
# 1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

n = input('Введите трехзначное число:')
a = int(n[0])
b = int(n[1])
c = int(n[2])
print("Сумма цифр:", a + b + c)
print("Произведение цифр:", a * b * c)
